app/views/admin/members/_form_edit.html.erb

SELECT "projects".* FROM "projects"
SELECT "projects".*, t0.member_id as the_parent_record_id FROM "projects" INNER JOIN "members_projects" t0 ON "projects".id = t0.project_id WHERE (t0.member_id = 14)
---
				<td class="last">
          <% for project in Project.all %>
            <%= check_box_tag 'member[project_ids][]', project.id, @member.projects.include?(project) %>