app/views/admin/members/_form.html.erb

				<td class="last">
          <% for project in Project.all %>
---
SELECT "projects".* FROM "projects"