app/controllers/admin/members_controller.rb

  def create
    @member = Member.new(params[:member])
    if @member.save
---
INSERT INTO "members" ("comment", "created_at", "email", "list1_content_type", "list1_file_name", "list2_content_type", "list2_file_name", "name", "name_eng", "profile_content_type", "profile_file_name", "resume_content_type", "resume_file_name", "school", "tags", "twitter", "updated_at", "website") VALUES ('hi', '2010-11-20 08:25:12.480329', 'all4me@wafflestudio.com', NULL, NULL, NULL, NULL, '조현아', 'HyunA Cho', NULL, NULL, NULL, NULL, '성균관대학교 컴퓨터교육과 09', '---

  def edit
    @member = Member.find params[:id], :include => [:projects]
---
SELECT "members".* FROM "members" WHERE ("members"."id" = 11) LIMIT 1
SELECT "projects"."id" FROM "projects" INNER JOIN "members_projects" ON "projects".id = "members_projects".project_id WHERE ("members_projects".member_id = 11 ) AND ("projects"."id" = 3) LIMIT 1

  def update
    @member = Member.find params[:id]
    if @member.update_attributes(params[:member])
---
SELECT "members".* FROM "members" WHERE ("members"."id" = 13) LIMIT 1
UPDATE "members" SET "comment" = '안녕하세요', "email" = 'thefron@wafflestudio.com', "name" = '황호성', "name_eng" = 'Hoseong Hwang', "resume_content_type" = 'application/pdf', "resume_file_name" = 'gjanne_resume (1).pdf', "school" = '서울대학교 컴퓨터공학부 08', "tags" = '---

  def destroy
    Member.destroy(params[:id])
---
DELETE FROM "members" WHERE ("members"."id" = 8)