app/controllers/admin/projects_controller.rb

  def create
    @project = Project.new(params[:project])
    if @project.save
---
INSERT INTO "projects" ("created_at", "description", "link", "name", "start_date", "status", "updated_at") VALUES ('2010-11-20 13:08:28.131274', '', '', 'SNUEV', NULL, 'on', '2010-11-20 13:08:28.131274')

  def edit
    @project = Project.find params[:id], :include => [:members]
---
SELECT "members".*, t0.project_id as the_parent_record_id FROM "members" INNER JOIN "members_projects" t0 ON "members".id = t0.member_id WHERE (t0.project_id = 2)
SELECT "projects".* FROM "projects" WHERE ("projects"."id" = 2) LIMIT 1

  def update
    @project = Project.find params[:id]
    if @project.update_attributes(params[:project])
---
SELECT "projects".* FROM "projects" WHERE ("projects"."id" = 2) LIMIT 1
UPDATE "projects" SET "description" = 'ㅇㅇㄹ23123', "start_date" = '2010-02-10', "updated_at" = '2010-11-20 16:20:52.780119' WHERE ("projects"."id" = 2)

  def destroy_screenshot
    Screenshot.destroy(params[:id])
---
DELETE FROM "screenshots" WHERE ("screenshots"."id" = 1)