app/views/admin/projects/_form_edit.html.erb

SELECT "members".* FROM "members"
SELECT "members".*, t0.project_id as the_parent_record_id FROM "members" INNER JOIN "members_projects" t0 ON "members".id = t0.member_id WHERE (t0.project_id = 2)
---
				<td class="last">
          <% for member in Member.all %>
            <%= check_box_tag 'project[member_ids][]', member.id, @project.members.include?(member) %>

SELECT "screenshots".* FROM "screenshots" WHERE ("screenshots".project_id = 2)
---
          <% end %>
          <% for i in (1..5-@project.screenshots.length) %>