app/views/admin/projects/_form.html.erb

				<td class="last">
          <% for member in Member.all %>
---
SELECT "members".* FROM "members"